{
  "publishedAt": "1st May 2024",
  "title": "I'm 30. And a failure. What's next?",
  "content": "It’s 2024. And I’m going to turn 30 soon. I feel so old, and unsuccessful… \n\nOver the last many years, I’ve followed the traditional path of going to a school…then college. \n\n22 years, spent just like that. Following the society.\n\nThankfully, wisdom dawned on me and I spent the last 8 years in experimentation. \n\n3 years in trying out different roles. \n\n1 year in writing a book. \n\nAnd the last 4+ years in diving deeper into the field of Marketing. \n\nI gotta say…nothing captures my heart and attention like Marketing. \n\nI feel like I can solve any marketing / growth problem in the world. \n\nAnd I can make as much money as I want to. IF making money was the goal. \n\nBut there is a secret to everything. The secret to great marketing, is, \n\nA passionate marketer…combined with a passionate builder. \n\nThis combination is dangerous. \n\nThis combination will captivate the hearts of people like no other. \n\nAnd we’ve seen this combination in the past… \n\nSteve Jobs and Steve Wozniak \n\nBill Gates and Paul Allen \n\nLarry Page and Sergey Brin \n\namong others… \n\nThe truth is, I’ve not yet come across a passionate builder. \n\nSomeone who is as passionate about their craft, as I am about mine. \n\nI do believe that passion or love of the craft is crucial for success, and to produce great work. \n\nPeople ask me whether I know ‘X’ or ‘Y’ or ‘Z’ skill in marketing.\n\nAnd my answer to them is that such ‘skills’ are readily bought and sold on marketplace platforms like fiverr and Upwork. \n\nIt is a commodity. \n\nBut passion is not.\n\nYou can’t buy passion. You can’t buy passionate people either. \n\nBecause they don’t “work” for money.\n\nThis passion is the single biggest reason why I’m confident about picking up any skill within marketing and becoming good at it within 6 months. \n\nSo now that I know that I’m passionate about marketing and want to devote my life to it, what’s next? \n\nSuccess. \n\nUnfathomable, unstoppable success. \n\nIf I know that I have the talent to be great and world-class in my field, yet I don’t utilize it to achieve success, what’s the point? \n\nSuccess in my field is actually tied to revenue. \n\nThe more the marketing contribution to revenue, the more ‘successful’ one is.\n\nSo, if I have to achieve revenue, I need to sell. \n\nIf I have to sell, I need a product worth selling. \n\nWhether a product is worth selling or not, depends on the state in which it was created. \n\nIf it was created solely to “sell”, it is most definitely not worth selling.\n\nIf it’s created out of a state of inspiration, we can talk. \n\nBut since I don’t have any such product yet, \n\nI’ll create content out of a state of inspiration.\n\nAnd build my own brand. \n\nAnd massive trust. \n\nAround myself. And marketing. \n\nSo when I’m ready to launch my own product, \n\nI’ll have n number of people that I can sell to. \n\n**\\-    -     -**"
}