{
  "title": "Why I Fired Myself From My Job ",
  "content": "The people who know me, know that I’m kinda crazy… do what I want. Not afraid of taking risks. \n\nBold. Or stupid? \n\nThe past 18 months of working at Nintee, was nothing short of an experience. \n\nI don’t mean work experience. I mean the kind of experience you get at a luxury 5 star hotel. \n\nI don’t even know why I’m comparing Nintee to a 5 star hotel, lol. \n\nMaybe it’s highly subjective. Perhaps it is specific to the individual. \n\nFor me, it was. Like a 5-star experience. \n\nAs I delve into the details of how that came to be, it’s hard for me to pin-point a specific thing that went well.\n\nMaybe ‘twas the culture. Maybe it was the team. Or maybe it was my experience of working with [paras](https://www.linkedin.com/in/paraschopra/)? \n\nI don’t know… \n\nI think it was a feeling.\\\n\\\nA feeling of – \n\n1. I trust you \n2. You can be yourself here \n3. We’re all in this together \n4. Let’s learn this. And this. And that. \n5. How can I help you to be successful? \n\nMinimal rules. 0 hierarchy / bureaucracy. \n\nI could move fast. \n\nI could get anything done. \n\nI felt incredibly powerful. And lucky, to be working at Nintee.\n\nFor someone who loves their craft, what could be better than this? \n\nThis is also, probably why, the most amount of learning in my career has happened at Nintee. \n\nForget accelerated vesting. I’m talking about accelerated learning. \n\nOn top of that, I got paid to learn. \n\nI got to work with beautiful human beings. \n\nWhy would anyone leave such an organization? \n\nWell, because the company doesn’t need marketing right now. \n\nIt needs market-product fit. \n\nIt needs product. \n\nSo if the company doesn’t need marketing right now, what’s the point of staying in the company as a marketer? \n\nI don’t like rent-seeking. \n\nI have some friends though, who enjoy it. \n\nFor me, there’s nothing more dry than wasting / killing time at work. \n\nI have to see an immediate impact of what I’m doing. \n\nThere are only so many tomorrows…",
  "date": "2024-03-25",
  "publishedAt": "25th Mar 2024"
}